InformationRegisters/АктивностьПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АктивностьПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусАктивности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипАктивности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АктивностьПользователей/Ext/ManagerModule.bsl
//ТипАктивности = "РедактироватьПлан"

Функция ПолучитьПользователяАктивности(ТипАктивности, Проект) Экспорт
	
	ДанныеАктивности = Новый Структура("Активность, Пользователь, ВремяАктивности", 
										Ложь,
										Справочники.Пользователи.ПустаяСсылка(),
										Дата(1, 1, 1));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктивностьПользователей.ВремяАктивности КАК ВремяАктивности,
		|	АктивностьПользователей.Пользователь КАК Пользователь,
		|	АктивностьПользователей.СтатусАктивности КАК Активность
		|ИЗ
		|	РегистрСведений.АктивностьПользователей КАК АктивностьПользователей
		|ГДЕ
		|	АктивностьПользователей.ТипАктивности = &ТипАктивности
		|	И АктивностьПользователей.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Проект", 		Проект);
	Запрос.УстановитьПараметр("ТипАктивности", 	ТипАктивности);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеАктивности, Выборка); 
	КонецЦикла;
	
	Возврат ДанныеАктивности;

КонецФункции // ПолучитьПользователяАктивности()

Функция УстановитьПользователяАктивности(ТипАктивности, Проект, Пользователь) Экспорт
	
	Попытка
		
		НачатьТранзакцию();
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.АктивностьПользователей");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ТипАктивности", ТипАктивности);
		ЭлементБлокировки.УстановитьЗначение("Проект", Проект);
		БлокировкаДанных.Заблокировать();
		
		ДанныеАктивности = ПолучитьПользователяАктивности(ТипАктивности, Проект);
		ДанныеАктивности.Вставить("АктивностьИзменена" ,Ложь);
		
		
		Если ДанныеАктивности.Активность Тогда
			
			Возврат ДанныеАктивности;	
			
		КонецЕсли;
		
		ВремяАктивности 		= ТекущаяДата();
		ТекущийПользователь  	= ПараметрыСеанса.ТекущийПользователь;
		
		МенеджерЗаписи = РегистрыСведений.АктивностьПользователей.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.СтатусАктивности = Истина;
		МенеджерЗаписи.ВремяАктивности 	= ВремяАктивности;
		МенеджерЗаписи.Пользователь 	= ТекущийПользователь; 
		МенеджерЗаписи.Комплект			= Справочники.Композиции.ПустаяСсылка(); 
		МенеджерЗаписи.Проект			= Проект; 
		МенеджерЗаписи.ТипАктивности 	= ТипАктивности;
		
		МенеджерЗаписи.Записать();
		
		ДанныеАктивности.АктивностьИзменена = Истина;
		ДанныеАктивности.Активность 		= Истина;
		ДанныеАктивности.Пользователь 		= ТекущийПользователь;
		ДанныеАктивности.ВремяАктивности	= ВремяАктивности;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ДанныеАктивности;
КонецФункции // ПолучитьПользователяАктивности()


Процедура ОчиститьАктивностьРедактироватьПлан() Экспорт
	
	МенеджерЗаписи = РегистрыСведений.АктивностьПользователей.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ТипАктивности 	= "РедактироватьПлан";
	МенеджерЗаписи.Пользователь 	= ПараметрыСеанса.ТекущийПользователь;
	
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры
